artillery/load_test.yml
config:
    target: "https://e-commerce-app-vtwx.onrender.com"
    phases:
        - duration: 120
          arrivalRate: 0
          rampTo: 100
          name: Ramp up
        - duration: 300
          arrivalRate: 100
          name: Steady load
        - duration: 120
          arrivalRate: 100
          rampTo: 0
          name: Ramp down
    payload:
        - path: data/userIds.csv
          fields: ["userId"]
          order: random
          skipHeader: true
        - path: data/productIds.csv
          fields: ["productId"]
          order: random
          skipHeader: true
    http:
        timeout: 30
scenarios:
    - name: Browse products
      flow:
          - get:
                url: "/products?page={{ $randomNumber(1,10) }}&limit=20"
    - name: Add to cart
      flow:
          - post:
                url: "/cart"
                json:
                    userId: "{{ userId }}"
                    productId: "{{ productId }}"
                    quantity: 1
    - name: Place order
      flow:
          - post:
                url: "/orders"
                json:
                    userId: "{{ userId }}"
                    items:
                        - productId: "{{ productId }}"
                          quantity: 1
                    total: 699