artillery/spike_test.yml
config:
    target: "https://e-commerce-app-vtwx.onrender.com"
    phases:
        - duration: 60
          arrivalRate: 0
          rampTo: 500
          name: Spike
        - duration: 60
          arrivalRate: 500
          rampTo: 0
          name: Ramp down spike
    payload:
        - path: data/userIds.csv
          fields: ["userId"]
          order: random
          skipHeader: true
        - path: data/productIds.csv
          fields: ["productId"]
          order: random
          skipHeader: true
    http:
        timeout: 30
scenarios:
    - name: Add to cart
      flow:
          - post:
                url: "/cart"
                json:
                    userId: "{{ userId }}"
                    productId: "{{ productId }}"
                    quantity: 1
    - name: Place order
      flow:
          - post:
                url: "/orders"
                json:
                    userId: "{{ userId }}"
                    items:
                        - productId: "{{ productId }}"
                          quantity: 1
                    total: 699